Marylebone/Marylebone_mesh/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

epsilonInlet  0.03; // Cmu^0.75 * k^1.5 / L ; L =10

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilonInlet;

boundaryField
{
    inlet
    {
       type            atmBoundaryLayerInletEpsilon;
       flowDir              (1 0 0);
       zDir               (0 0 1);
       Uref            0.7287;
       Zref            557;
       z0              uniform 0.1;
       zGround         uniform 0.0;
       value           uniform $epsilonInlet;
   }


    outlet
    {
        type            inletOutlet;
        inletValue      uniform $epsilonInlet;
        value           uniform $epsilonInlet;
    }

    wall
    {
        type            epsilonWallFunction;
        value           uniform $epsilonInlet;
    }

    #includeEtc "caseDicts/setConstraintTypes"

//frontAndBack
//{
//  type            calculated;
//  value           uniform 0;  }
}

// ************************************************************************* //
