Marylebone/Marylebone_mesh/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceFeatureExtract

blockMesh

decomposePar

mpirun -np 8 snappyHexMesh -overwrite -parallel

reconstructPar -constant
#------------------------------------------------------------------------------
